Table of Contents
 Class ImportersConfiguration
Namespace
IdeaStatiCa.BimApiLink
Assembly
IdeaStatiCa.BimApiLink.dll
public sealed class ImportersConfiguration
Inheritance
object
ImportersConfiguration
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Methods
 RegisterContainer(IServiceProvider)
public ImportersConfiguration RegisterContainer(IServiceProvider serviceProvider)
Parameters
serviceProvider IServiceProvider
Returns
ImportersConfiguration
 RegisterImporter<T>(IImporter<T>)
public ImportersConfiguration RegisterImporter<T>(IImporter<T> importer) where T : IIdeaObject
Parameters
importer IImporter<T>
Returns
ImportersConfiguration
Type Parameters
T
 RegisterImporter<T>(Func<IImporter<T>>)
public ImportersConfiguration RegisterImporter<T>(Func<IImporter<T>> factory) where T : IIdeaObject
Parameters
factory Func<IImporter<T>>
Returns
ImportersConfiguration
Type Parameters
T
 RegisterProvider(IImporterProvider)
public ImportersConfiguration RegisterProvider(IImporterProvider provider)
Parameters
provider IImporterProvider
Returns
ImportersConfiguration
 Edit this page